![img](../data/images.png)

# TP2 Analyse de données  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2022_2023
-------

## Exercice 1 :
1. Importer la bibliothèque `sqlite3` et la bibliothèque `pandas` avec l'alias `pd`.

2. Créer une connection `conn` en pointant le fichier `customer_sales.db'` se trouvant dans le chemin `/data/source/ `. 

3. Créer le data frame **df_sales** à partir de la connection faite en a.
    
4. Donner l'index de **df_sales**.
    
5. Changer l'index de **df_sales** en `Sales_Id`.
    
6. Afficher les $2$ premières ligne du dataframe **df_sales**.
    
7. Inspecter les informations de **df_sales** ( utiliser `df.info` ). Y-a-t il des données manquantes?

8. Trier **df_sales** selon la colonne `Sale_date` par ordre croissant. Donner la description de l'achat le plus récent ?
9. Séléctionner toutes les données de **df_sales** tels que `['Sales_Amount'] > 100`.
10. Séléctionner toutes les données de **df_sales** tels que `['Sales_Quantity'] =1`.

### Réponse à la question 3 ( Code SQL)

* Installer `ipython-sql` avec la commande : 
```python
!pip install ipython-sql
``` 
* Exécuter dans une autre cellules
> ```python
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db
```
* Puis
>```python
%%sql
select * from tbl_sales
where Sales_Amount > 100
```

In [ ]:
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db

In [ ]:
# Importer la bibliothèque pandas avec l'alias pd
import pandas as pd

In [ ]:
# Importer la bibliothèque sqlite3
import sqlite3

In [ ]:
%%sql
select * from tbl_sales
where Sales_Amount > 100

### Espace résérvé à la correction 

* Q1

In [ ]:
# Importer la bibliothèque sqlite3
import sqlite3

In [ ]:
# Importer la bibliothèque pandas avec l'alias pd
import pandas as pd

* Q2

In [ ]:
conn=sqlite3.connect('../data/source/customer_sales.db')

* Q3

In [ ]:
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())
df_sales = pd.read_sql_query("SELECT * FROM tbl_sales", conn)
df_sales

* Q4

In [ ]:

 # obtenir les indexes du dataframe par defaut du pandas
df_sales.index

* Q5

In [ ]:
df_sales = pd.read_sql_query("SELECT * FROM tbl_sales", conn,index_col='Sale_ID')
df_sales

* Q6

In [ ]:
df_sales.head(2)

* Q7

In [ ]:
df_sales.info()
# () resume du resume 
# sans parnethese  detaillé
# si n non nul < n entries => il y a des val manquantes

* Q8

In [ ]:
df_sales["Sale_Date"] = pd.to_datetime(df_sales["Sale_Date"])
df_sales.sort_values(by='Sale_Date')
# df_sales.info() Sale_Date => datetime
df_sales.tail(1)

* Q9

In [15]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (0.4.1)
Requirement already satisfied: ipython>=1.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (8.5.0)
Requirement already satisfied: sqlparse in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: six in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (1.4.41)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: pickleshare in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.5)
Requirement already satisfied: traitlets>=5 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (5.4.0)
Requirement already satisfied: jedi>=0.16 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: decorator in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit<3.1.0,>3.0.1 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.31)
Requirement already satisfied: stack-data in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.5.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (2.13.0)
Requirement already satisfied: matplotlib-inline in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: greenlet!=0.4.17; python_version >= "3" and (platform_machine == "aarch64" or (platform_machine == "ppc64le" or (platform_machine == "x86_64" or (platform_machine == "amd64" or (platform_machine == "AMD64" or (platform_machine == "win32" or platform_machine == "WIN32")))))) in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.3)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from prompt-toolkit<3.1.0,>3.0.1->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: pure-eval in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.8)
Requirement already satisfied: executing in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2.3; however, version 22.2.2 is available.
You should consider upgrading via the 'c:\Users\User\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [16]:
%%capture
%load_ext sql
%sql sqlite:///customer_sales.db

In [17]:
%%sql
select * from tbl_sales
where Sales_Amount > 100

 * sqlite:///customer_sales.db
Done.

[(4, '11/11/2015', 'Sales Convention Purchase', 3, 3, 500, 100)]

In [18]:
df_sales[df_sales['Sales_Amount']>100]
# pour obtenir la ligne exactement 
# df_sales['Sales_Amount']>100 tous les lignes de type booleen

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
4,2015-11-11,Sales Convention Purchase,3,3,500,100

* Q10

In [19]:
%%sql
select * from tbl_sales
where Sales_Quantity == 1

 * sqlite:///customer_sales.db
Done.

[(1, '12/31/2014', 'Purchased from Store', 2, 2, 20, 1),
 (3, '6/14/2015', 'Internet Purchase', 3, 3, 5, 1),
 (6, '10/15/2016', 'Purchased from Store', 5, 1, 20, 1),
 (7, '3/17/2017', 'Internet Purchase', 4, 1, 20, 1),
 (8, '6/15/2018', 'Purchased from Store', 3, 3, 5, 1)]

In [20]:
df_sales[df_sales['Sales_Quantity']==1]

,Sale_Date,Description,Customer_ID,Product_ID,Sales_Amount,Sales_Quantity
Sale_ID,,,,,,
1,2014-12-31,Purchased from Store,2,2,20,1
3,2015-06-14,Internet Purchase,3,3,5,1
6,2016-10-15,Purchased from Store,5,1,20,1
7,2017-03-17,Internet Purchase,4,1,20,1
8,2018-06-15,Purchased from Store,3,3,5,1

## EXERCICE 2 :

> * Corriger les erreurs éventuelles
> * Interpréter et commenter chaque ligne de code

In [21]:
import pandas as pd

In [22]:
df_user_churn_cleaned = pd.read_csv('../data/source/user_hits_binning_import.csv', parse_dates=['date'])
df_user_churn_cleaned

    userid       date
0        1 2017-01-01
1        2 2017-01-02
2        3 2017-01-03
3        4 2018-01-01
4        5 2018-01-02
5        6 2018-10-03
6        1 2019-10-01
7        3 2019-10-02
8        7 2019-10-03
9        8 2020-01-01
10       1 2020-01-02
11       2 2020-01-03

In [23]:
df_user_churn_cleaned.head(10)

   userid       date
0       1 2017-01-01
1       2 2017-01-02
2       3 2017-01-03
3       4 2018-01-01
4       5 2018-01-02
5       6 2018-10-03
6       1 2019-10-01
7       3 2019-10-02
8       7 2019-10-03
9       8 2020-01-01

In [24]:
from datetime import datetime
import numpy as np

In [25]:
datetime.now()

datetime.datetime(2022, 10, 9, 14, 2, 7, 808386)

In [26]:
df_user_churn_cleaned['age'] = (datetime.now() - pd.to_datetime(df_user_churn_cleaned['date'])).dt.days

In [27]:
df_user_churn_cleaned

    userid       date   age
0        1 2017-01-01  2107
1        2 2017-01-02  2106
2        3 2017-01-03  2105
3        4 2018-01-01  1742
4        5 2018-01-02  1741
5        6 2018-10-03  1467
6        1 2019-10-01  1104
7        3 2019-10-02  1103
8        7 2019-10-03  1102
9        8 2020-01-01  1012
10       1 2020-01-02  1011
11       2 2020-01-03  1010

In [28]:
df_ages = df_user_churn_cleaned.groupby('userid').max()
# df_ages = df_user_churn_cleaned.groupby('userid').count()

df_ages

             date   age
userid
1      2020-01-02  2107
2      2020-01-03  2106
3      2019-10-02  2105
4      2018-01-01  1742
5      2018-01-02  1741
6      2018-10-03  1467
7      2019-10-03  1102
8      2020-01-01  1012

In [ ]:
365*5

In [29]:
df_ages['age_bin'] = pd.cut(x=df_ages['age'], bins=[1, 1094, 1825, 9999], labels=['< 3 year', '3 to 5 years', '> 5 years'])
df_ages

             date   age       age_bin
userid
1      2020-01-02  2107     > 5 years
2      2020-01-03  2106     > 5 years
3      2019-10-02  2105     > 5 years
4      2018-01-01  1742  3 to 5 years
5      2018-01-02  1741  3 to 5 years
6      2018-10-03  1467  3 to 5 years
7      2019-10-03  1102  3 to 5 years
8      2020-01-01  1012      < 3 year

In [ ]:
#df_ages['age_by_decade'] = pd.cut(x=df_ages['age'], bins=[__, __, __], labels=['< 1 year', '1 to 2 years', '> 3 years'])

In [ ]:
#df_user_churn_cleaned['day_of_week_in_number'] = pd.df_user_churn_cleaned['date'].dt.dayofweek

In [ ]:
df_ages

In [30]:
df_grouped = df_ages.groupby('age_bin').count()

In [31]:
df_grouped

              date  age
age_bin
< 3 year         1    1
3 to 5 years     4    4
> 5 years        3    3

In [ ]:
df_grouped.drop(['date'], axis=1)
# ==> supprime une ligne ou une colonne tout depend de l'axis
# axis=1 => colonne
# axis=0 => ligne

In [32]:
df_grouped.rename(columns={'age': 'user count'}, inplace=True)

In [33]:
df_grouped

              date  user count
age_bin
< 3 year         1           1
3 to 5 years     4           4
> 5 years        3           3

In [ ]:
df_grouped.drop(['date'], axis=1)

|Commande | description          |
|---------|----------------------|
|```df.index```| Obtenir les indexes du dataframe par defaut du pandas|
|```pd.read_sql_query(Requete,conn,index_col='ID')```| Changer l'index en ID.|
|```df.info()```| Inspecter des informations|
|```df.info```|Inspecter des informations plus détaillées|
|```df.sort_values(by='nomColonne')```| Trier `df` selon la colonne `nomColonne` par ordre croissant|
|```df.groupby('nomColonne').max()```| Afficher les colonnes triés par ordre croissant selon la colonne `nomColonne`|
|```pandas.cut(x=array, bins=[sequence of int], labels=['labels pour chaque ligne'])```| Regroupez les valeurs en intervalles discrets.|
|```df.groupby('nomColonne').count()```| calculer le nombre de chaque groupe de la colonne `nomColonne` |
|```df.rename(columns={'oldname': 'newName'}, inplace=bool)```| modifier le nom de la colonne en paramétre (`inplace`: si True, la valeur de la copie est ignorée.) |
|```df.drop(LISTE, axis=0)```| Supprime une `LISTE` ligne|
|```df.drop(LISTE, axis=1)```| Supprime une `LISTE` colonne|

$\int_a^b f(x) dx $
$$ \sum_{k=1}^{\infty}\frac{1}{k^2}=\frac{\pi^2}{6}$$